<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
            'عرض-الفواتير',
            //'عرض-قائمة-الفواتير',
            'عرض-الفواتير-المدفوعة',
            'عرض-الفواتير-المدفوعة-جزئيا',
            'عرض-الفواتير-الغير-مدفوعة',
            'عرض-ارشيف-الفواتير',

            'التقارير',
            'تقرير-الفواتير',
            'تقرير-العملاء',

            'المستخدمين',
            'عرض-قائمة-المستخدمين',
            'عرض-صلاحيات-المستخدمين',
            'الاعدادات',
            'الاقسام',

            'اضافة-فاتورة',
            'حذف-فاتورة',
            'تصدير-Excel',
            'تغير-حالة-الدفع',
            'تعديل-فاتورة',
            'ارشفة-فاتورة',
            'طباعة-فاتورة',

            'اضافة-مرفق',
            'حذف-مرفق',

            'اضافة-مستخدم',
            'تعديل-مستخدم',
            'حذف-مستخدم',

            'عرض-صلاحية',
            'اضافة-صلاحية',
            'تعديل-صلاحية',
            'حذف-صلاحية',

            'عرض-منتج',
            'اضافة-منتج',
            'تعديل-منتج',
            'حذف-منتج',
            'عرض-قسم',
            'اضافة-قسم',
            'تعديل-قسم',
            'حذف-قسم',

        ];

        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
